[
  {
    "title": "Monkey Tea",
    "subTitle": "Monkey Tea - Wildly Original, Naturally Sri Lankan",
    "description": "Monkey Tea is a fun, youth-focused tea brand that blends locally sourced Ceylon tea with bold flavors and vibrant energy. Inspired by the playful spirit of Sri Lanka’s forests and wildlife, the brand is all about making tea exciting for a new generation. Monkey Tea isn’t just a drink — it’s a lifestyle of bold taste, local pride, and creative expression.",
    "clientProblem": "Monkey Tea had a great concept but lacked visual consistency and brand clarity. The original design failed to connect with younger audiences and didn’t reflect the energy or personality behind the product. The brand needed a fresh, cohesive identity to stand out in both local and global markets.",
    "ourSolution": "The Double Drift reimagined Monkey Tea with a bold, youthful brand identity full of color, character, and motion. We crafted a custom-illustrated mascot, dynamic packaging, and a fun visual system that reflected the wild, free-spirited nature of the brand. With vibrant storytelling and a social-media-ready look, Monkey Tea transformed into a standout name in the next-gen tea market.",
    "client": "Monkey Tea",
    "Project": "Full Branding",
    "Website": "http://www.monkeytea.com/",
    "mainImage": "/project-images/monkey-tea/MonkeyTea.png"
  },
  {
    "title": "CHA TEA",
    "subTitle": "Cha Tea – A Modern Ritual in Every Sip",
    "description": "Cha Tea is a premium tea brand that reimagines the timeless ritual of tea drinking for the modern world. Rooted in tradition but crafted for contemporary tastes, the brand offers a curated collection of high-quality teas sourced with care and presented with elegance. More than just a beverage, Cha Tea represents a lifestyle — one that celebrates mindfulness, sophistication, and cultural heritage. Every element of the brand, from its packaging to its storytelling, is designed to evoke a serene, luxurious experience that resonates with discerning tea lovers around the globe. Cha Tea is where classic tea culture meets modern design — offering a moment of calm in a fast-paced world.",
    "clientProblem": "Cha Tea aimed to position itself as a premium tea lifestyle brand but lacked a distinct identity and cohesive visual language. Their existing branding failed to communicate the elegance, heritage, and sensory richness of their product, making it difficult to attract high-end tea consumers in a saturated market.",
    "ourSolution": "The Double Drift developed a sophisticated and modern brand identity for Cha Tea, merging timeless tradition with contemporary minimalism. From logo design and packaging to art direction and digital presence, we crafted a visual narrative that evoked luxury, calm, and craftsmanship. The refined aesthetic elevated Cha Tea’s market perception and helped the brand connect emotionally with its target audience.",
    "client": "Cha tea.inc",
    "Project": "Full Branding",
    "Website": "http://www.chateachina.com/",
    "mainImage": "/project-images/cha-tea/ChaTea.png"
  },
  {
    "title": "SKEEM",
    "subTitle": "Skem: Myth of Beauty – Where Ancient Myths Meet Modern Skin",
    "description": "Skem is a high-concept skincare brand inspired by ancient beauty rituals, herbal wisdom, and the timeless myths that shaped our understanding of self-care. Each product is carefully formulated using natural ingredients and backed by science, offering a sensory experience that feels both powerful and poetic. Skem is more than skincare — it’s a modern mythology of beauty.",
    "clientProblem": "Skem had a unique concept but lacked a brand identity that could express its mythical, luxurious essence. The visuals were minimal and clinical, failing to capture the storytelling potential and emotional depth of the brand. This made it difficult to build a loyal, experience-driven customer base.",
    "ourSolution": "The Double Drift crafted a captivating visual identity that blended elegance with mysticism. We introduced an ethereal color palette, symbol-based iconography, and editorial-style packaging inspired by ancient manuscripts and goddess myths. The result was a visually immersive brand experience that elevated Skem from a product line to a storytelling skincare ritual.",
    "client": "Sekem Global",
    "Project": "Full Branding",
    "Website": "http://www.sekemglobal.com/",
    "mainImage": "/project-images/skeem/skeem.png"
  },
  {
    "title": "HELA",
    "subTitle": "Hela: Ceylon Cinnamon – Pure Spice, True Heritage",
    "description": "Hela is a premium cinnamon brand that brings the essence of true Ceylon cinnamon to the global market. Rooted in Sri Lanka’s rich agricultural heritage, Hela offers sustainably sourced, hand-rolled cinnamon crafted with care and tradition. The brand celebrates purity, wellness, and the timeless value of authentic spice.",
    "clientProblem": "Despite having a high-quality product, Hela struggled with a lack of brand differentiation. Their packaging was generic, and the brand failed to communicate the cultural richness and superior quality of Ceylon cinnamon. This limited their ability to attract premium buyers and expand into international markets.",
    "ourSolution": "The Double Drift developed a refined brand identity that highlighted the heritage, purity, and craftsmanship behind Hela. We designed minimalist, elegant packaging with cultural motifs, introduced a natural color palette, and created storytelling-driven visuals for both print and digital. The result positioned Hela as a trusted, high-end cinnamon brand, ready to compete globally.",
    "client": "Hela.Lanka",
    "Project": "Full Branding",
    "Website": "http://www.helalanka.lk/",
    "mainImage": "/project-images/hela/Hela.png"
  },
  {
    "title": "CARROT CHAMP",
    "subTitle": "Carrot Champ – Naturally Bold Snacking",
    "description": "Carrot Champ is a forward-thinking snack brand dedicated to redefining healthy eating with a bold twist. Specializing in carrot-based products, the brand champions clean, nutritious, and delicious alternatives to traditional snacks. With a mission to make healthy choices accessible and exciting, Carrot Champ blends natural ingredients with innovative flavor profiles to appeal to modern, health-conscious consumers. At its core, Carrot Champ isn’t just about snacks — it’s about inspiring a lifestyle rooted in wellness, sustainability, and vibrant living.",
    "clientProblem": "Carrot Champ, a startup focused on promoting healthy snacking with carrot-based products, struggled with brand recognition and visual identity. Their existing branding lacked personality, making it hard to connect with health-conscious millennials and parents looking for nutritious snack options.",
    "ourSolution": "The Double Drift created a vibrant and playful brand identity for Carrot Champ, from logo and packaging design to social media visuals. We positioned the brand as fun, fresh, and energetic, helping it stand out in a competitive market. The new look not only captured attention but also built trust and engagement with the target audience.",
    "client": "Hela.Lanka",
    "Project": "Full Branding",
    "Website": "http://www.helalanka.lk/",
    "mainImage": "/project-images/carrot-champ/CarrotChamp.png"
  },
  {
    "title": "WILD SIP",
    "subTitle": "Wild Sip – Pure Drop",
    "description": "Wild Sip is a vibrant beverage brand inspired by the untamed flavors of nature. Specializing in herbal infusions and botanical blends, the brand offers refreshing drinks made from wild, foraged ingredients sourced ethically from Sri Lanka’s forests and highlands. Wild Sip is all about reconnecting with nature — one bold, clean sip at a time.",
    "clientProblem": "Wild Sip had a great product and concept, but lacked a distinctive brand identity to communicate its wild, earthy essence. The packaging felt generic and didn’t reflect the raw, natural story behind the ingredients. This made it hard to compete in the growing health beverage market.",
    "ourSolution": "The Double Drift created a wild yet sophisticated brand identity that captures the raw beauty and vitality of nature. From textured illustrations and hand-drawn typography to earth-toned packaging and storytelling-driven labels, we crafted a cohesive visual system that made Wild Sip feel authentic and premium. The rebrand helped the product stand out on shelves and build deeper trust with eco-conscious consumers.",
    "client": "Wild Sip",
    "Project": "Full Branding",
    "Website": "http://www.wildslip.com/",
    "mainImage": "/project-images/wild-sip/WildSip.png"
  },
  {
    "title": "CHILI SPLASH",
    "subTitle": "Chili Splash - More spicy : More tasty",
    "description": "Chili Splash is a dynamic hot-sauce brand that celebrates the bold, vibrant flavors of chili peppers from around the world. Combining artisanal small-batch recipes with a playful spirit, the brand delivers a spectrum of heat, from mild warmth to tongue-tingling fire, in every bottle. Designed for the adventurous foodie, Chili Splash elevates everyday meals into memorable culinary experiences, whether you’re drizzling it on tacos, stirring it into soups, or spicing up your favorite snacks.",
    "clientProblem": "Chili Splash is a dynamic hot-sauce brand that celebrates the bold, vibrant flavors of chili peppers from around the world. Combining artisanal small-batch recipes with a playful spirit, the brand delivers a spectrum of heat, from mild warmth to tongue-tingling fire, in every bottle. Designed for the adventurous foodie, Chili Splash elevates everyday meals into memorable culinary experiences, whether you’re drizzling it on tacos, stirring it into soups, or spicing up your favorite snacks.",
    "ourSolution": "The Double Drift developed a refined brand identity that reflects Shehan’s artistic sensibility. We designed a minimalist, elegant logo, curated a warm, moody color palette, and created a clean, emotion-focused website layout that allows the photography to take center stage. The result was a cohesive brand system that elevated Shehan’s presence and positioned him for high-end bookings both locally and internationally.",
    "client": "Chili Splash.inc",
    "Project": "Full Branding",
    "Website": "http://www.chilisplash.com/",
    "mainImage": "/project-images/chili-splash/ChiliSplash.png"
  },
  {
    "title": "SHEHAN PERIS PHOTOGRAPHY",
    "subTitle": "Shehan Peiris Photography – Capturing Stories Through Light",
    "description": "Shehan Peiris is a fine art and lifestyle photographer known for his ability to tell powerful, emotional stories through natural light and cinematic framing. His work blends artistry with authenticity, capturing moments that feel both timeless and deeply personal — whether it’s weddings, portraits, or editorial work.",
    "clientProblem": "While Shehan had a strong portfolio, his brand lacked a clear visual identity and online presence. The inconsistent style across his materials made it difficult to communicate his unique photographic voice and attract premium clientele.",
    "ourSolution": "The Double Drift developed a refined brand identity that reflects Shehan’s artistic sensibility. We designed a minimalist, elegant logo, curated a warm, moody color palette, and created a clean, emotion-focused website layout that allows the photography to take center stage. The result was a cohesive brand system that elevated Shehan’s presence and positioned him for high-end bookings both locally and internationally.",
    "client": "Shehan Peiris",
    "Project": "Full Branding",
    "Website": "http://www.spphotography.com/",
    "mainImage": "/project-images/shehan-peiris-photography/ShehanPeirisPhotography.png"
  }
]
